openFoamRepoDev/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd17
// -*- C++ -*-

stdmd17
{
    ${stdmd01}

    patch          cylinder;
    modeSorter     kiewat;
}


// ************************************************************************* //
